# бебра

## Условие

Сегодня на уроке информатики в школе Насти рассказывали про НОД (GCD) и НОК (LCM) (см. ссылки ниже). Так как Настя очень умная, то она быстро сделала все задания, и теперь предлагает вам тоже решить одно из них.

Назовем пару целых чисел (a, b) хорошей, если GCD(a, b) = x и LCM(a, b) = y, где GCD(a, b) обозначает наибольший общий делитель чисел a и b, а LCM(a, b) обозначает наименьшее общее кратное чисел a и b.

Вам даются целые числа x и y. Требуется узнать количество хороших пар целых чисел (a, b) таких, что l ≤ a, b ≤ r. Заметьте, что пары (a, b) и (b, a) считаются различными, если a ≠ b.
Входные данные

В первой строке входных данных записано четыре целых числа l, r, x, y (1 ≤ l ≤ r ≤ 109, 1 ≤ x ≤ y ≤ 109).
Выходные данные

В первой строке выведите единственное число — ответ на задачу.

решение:

```cpp
#include <bits/stdc++.h>

using namespace std;

int gcd(int a, int b){
  while(b){
    int t = a%b;
    a = b;
    b = t;
  }
  return a;
}
signed main(){
  ios_base::sync_with_stdio(false);
  cin.tie(0);

  int l,r,x,y;
  cin >> l>>r>>x>>y;
  if (y%x !=0){
    cout << 0<<'\n';
    return 0;
  }
  int ans = 0;
  int n = y/x;
  for (int d=1;d*d<=n;++d){
    if (n%d==0){
      int c =n/d;
      if (l<= c*x&&c*x<<r &&l<= d*x&&d*x<<r && gcd(c,d)==1){
        if (d*d==n)++ans;
        else ans+=2;
      }
    }
  }
  cout << ans<<'\n';
  return 0;
}
```

# Задача - C - Codeforces

## Условие

- Вы — университетский тренер.
- Всего в университете под Вашим надзором `n` студентов.
- Умение программировать `i`-го студента равно `ai`.

## Цель

- Составить команду для нового соревнования по программированию.
- Максимальная по количеству студентов команда.
- Команда должна быть сбалансированной: умение программировать каждой пары студентов в команде должно отличаться не более, чем на 5.

## Задача

- Найти максимально возможное количество студентов в сбалансированной команде.

## Входные данные

- Первая строка: одно целое число `n` (1 ≤ n ≤ 2⋅10^5) — количество студентов.
- Вторая строка: `n` целых чисел `a1, a2, …, an` (1 ≤ ai ≤ 10^9), где `ai` означает умение `i`-го студента программировать.

## Выходные данные

- Выведите одно целое число — максимально возможное количество студентов в сбалансированной команде.

```
n = int(input())
mas = [int(x) for x in input().split()]
mas.sort()
a = mas
k = j = 0
for i in range(n):
    while j < n and a[j] - a[i] <= 5:
        j += 1
        k = max(k, j - i)
print(k)
```

# Задача: Максимальная сумма подотрезка с чередующейся четностью

## Условие

Ярик недавно нашёл массив \( a \) из \( n \) элементов, и ему стало очень интересно найти сумму непустого подотрезка с максимальной суммой. Но Ярик не любит числа одной чётности, стоящие рядом, так что у подотрезка, который он выберет, чётности соседних элементов должны различаться.

Например, массив \([1, 2, 3]\) подойдёт, но \([1, 2, 4]\) не подойдёт, так как 2 и 4 — чётные числа и стоят рядом.

Вам нужно помочь Ярику и вывести максимальную сумму такого подотрезка.

## Входные данные

Первая строка содержит одно целое число \( t \) (\(1 \leq t \leq 10^4\)) — количество наборов входных данных. Далее следуют описания этих наборов.

В первой строке дано одно целое число \( n \) (\(1 \leq n \leq 2 \cdot 10^5\)) — длина массива.

Во второй строке даны \( n \) целых чисел \( a_1, a_2, \ldots, a_n \) (\(-10^3 \leq a_i \leq 10^3\)) — элементы массива.

Гарантируется, что сумма \( n \) по всем наборам входных данных не превосходит \( 2 \cdot 10^5 \).

## Выходные данные

Для каждого набора данных выведите одно число — ответ на задачу.

```
ярик и последовательность
t = int(input())

for i in range(t):
    ans = []
    n = int(input())
    mas = [int(x) for x in input().split()]
    mn = min(0, mas[0])
    sm = ans = mas[0]
    for i in range(1, n):
        if abs(mas[i] % 2) == abs(mas[i - 1] % 2):
            mn = 0
            sm = 0
        sm += mas[i]
        ans = max(ans, sm - mn)
        mn = min(mn, sm)
    print(ans)
```

```

```
